[
{"title": "EY Vacationer Computer Science Program", "company": "EY\n\n", "job_description": "What if we didn’t focus on who you are now, but who you could become? At EY, we value you for your unique perspective and potential. We bring together extraordinary people, like you, to build a better working world. We're offering you more than just a job - we're offering you the exceptional EY experience. After all, it's not just about where you're going; it's about how you'll grow to get there.\n\nWhat’s in it for you? We offer more than just an internship. We offer a launchpad for personal and professional growth. You'll foster a strong network of colleagues, mentors, and leaders who are committed to supporting you on your EY journey and beyond. From the start, you'll receive dedicated training and coaching, work hands-on with real clients, and immerse in EY’s vibrant culture. Those who stand out may be offered a permanent role after graduation.\n\nWhat we can offer you Discover how at EY a career is yours to build. Explore our Benefits, Life and Culture. Learn more about Cultural Diversity, LGBTIQ+, Disability Inclusion, Gender Equality, and Aboriginal & Torres Strait Islanders programs at EY.\n\nWe’re currently looking for students from a range of degrees for all EY service lines. You can find out more about our service lines and teams by visiting our careers pages on our website.\n\nEligibility To be eligible for our Vacationer Program, you must meet the following criteria:\nYou are currently in the penultimate year of your degree \nYou are an Australian or New Zealand citizen, or an Australian permanent resident \nWe ask that you only submit one application.\n\nWhat you can expect All candidates are required to submit an online application attaching their passport (or alternative photo ID), CV and academic transcript \nAll eligible candidates will be invited to complete an online Job Simulation assessment which includes a video response question \nOnce we review your application and assessment results, you may be invited into an interview or Recruitment Day \nWe recommend applying early as we will be recruiting on an ongoing basis, and positions will close once filled.\n\nPlease note that it can take up to six weeks to hear from us as we have a rigorous recruitment process in place for our student program roles.\n\nAcknowledgement of Country EY acknowledges the Traditional Owners and Custodians of the lands on which EY offices are located around Australia. We pay our respects to their cultures, and to their Elders — past, present, and emerging. Find out more about our vision for reconciliation at ey.com/au/reconciliation\n\nApply now… we’re over 9,000 perspectives in Australia and we’re ready to welcome yours.\n\n###Discipline: Computer Science\n\n###Work_rights: New Zealand Citizen, Australian Citizen\n\n", "closing_date": "", "work_rights": "", "discipline": "Computer Science\n\n###Work_rights: New Zealand Citizen, Australian Citizen\n\n###Closing_date: 30th Dec 2024, 8:21 pm", "application_link": "https://www.ey.com/en_au/careers/students-apply-here"},
{"title": "Quantium Data Analytics Virtual Experience Program", "company": "Quantium\n\n", "job_description": "Quantium Data Analytics Virtual Experience Program, Share job ad, AI Job Summary, Read More, Quantium is a leading data science and AI Firm, founded in Australia in 2002 and offers a 19-year track record of innovation in data science., Quantium combines the best of human and artificial intelligence to power possibilities for individuals, organisations and society. For the first time, you can learn how an international leader like Quantium conducts analytics through our Data Analytics virtual program., Data allows us to unearth ideas, to solve problems and grasp opportunities that could change the world. It’s time for you to explore the possibilities of data analytics and discover the insights beneath the data.\n\n", "closing_date": "22-10-2024\n\n", "work_rights": "New Zealand Citizen, Australian Citizen\n\n", "discipline": "Actuarial Studies, Computer Science, Consulting, Engineering", "application_link": "https://www.theforage.com/simulations/quantium/data-analytics-rqkb"},
{"title": "2025/26 ANZ Australia Summer Intern Program - Expression of Interest", "company": "ANZ Australia\n\n", "job_description": "We are now inviting early expressions of interest for our 2025/2026 Australia Summer Internships, which will commence in November 2025. No matter where your career takes you, our Summer Intern Program aims to provide you with the foundations you need to grow and succeed. Our paid eight-week program is a great way to explore a career with ANZ, and gain invaluable experience.\n\n", "closing_date": "31st Dec 2024, 12:59 pm\n\n", "work_rights": "New Zealand Citizen, Australian Citizen,\n\n", "discipline": "Accounting, Administration, Arts and Humanities, Banking", "application_link": null},
{"title": "2025-2026 NAB Summer Intern Program - Expression of Interest", "company": "National Australia Bank (NAB)\n\n", "job_description": "Our customers come from all walks of life and so do we. Start your career with an organisation that celebrates and thrives on the differences in our people. We know you’ve studied hard and might not know exactly what you want to do when you finish your degree. We understand it’s not always easy to find your way. Our Summer Intern Program is an 8 week paid program run over the university summer semester break designed to back you in this early stage of your career, to help you develop the skills, knowledge and network with which to build an exciting and inspiring career, no matter where it takes you. \n\nHow our Summer Intern Program works: This year our program involves Employability and Future Skills development workshops combined with an immersive business placement. You’ll not only gain insights into the banking and finance industry, but you'll also learn more about your own working style with a personal action plan. You’ll be provided career coaching to determine what you want from your career and how to achieve it. At the end of our program, you’ll have the opportunity to apply and potentially receive an early offer for our Graduate Program the following year. \n\nSummer Intern Program Business Areas: Our intern program will see you choose one of our core business areas: Business Banking, Corporate and Institutional Banking, Private Wealth, Personal Banking, Risk, People and Culture, Strategy & Innovation, Finance. Our programs are Melbourne, Sydney, Brisbane & Perth based. Please visit our website for more information https://au.gradconnection.com/employers/nab/#nab-summer-intern-program\n\n", "closing_date": "22nd Jun 2025, 1:59 pm\n\n", "work_rights": "New Zealand Citizen, Australian Citizen, \n\n", "discipline": "Accounting, Actuarial Studies, Administration, Architecture, Banking, show more", "application_link": "https://2025summerinternprogramexpressionofinterest-nab.pushapply.com/login"},
{"title": "Register for the 2025/2026 Vacationer Program", "company": "EY\n\n", "job_description": "Register for the 2025/2026 Vacationer Program, Share job ad, AI Job Summary, Read More, If you have an interest in joining EY through our Vacationer Program, we encourage you to register your details. We’ll be in touch to let you know when applications are opening for our 2025/2026 programs. Want to know a little more about the program? Throughout the program, you’ll hit the ground running with dedicated on-the-job training, coaching and technology onboarding. You’ll work alongside EY professionals on real clients – right now. You’ll get the opportunity to be immersed in EY culture, network with EY people, and experience the transformative work done for EY clients. Plus, the best bit is, if you impress us we’ll offer you a permanent position after you graduate. To be eligible for our Vacationer Program, you’ll need to be In the penultimate year of your degree An Australian or New Zealand citizen, or an Australian permanent resident. Register your interest today!\n\n", "closing_date": "29th Dec 2024, 10:59 am\n\n", "work_rights": "New Zealand Citizen, Australian Citizen\n\n", "discipline": "Accounting, Actuarial Studies, Banking and Finance", "application_link": "https://globaleysurvey.ey.com/jfe/form/SV_8nLzawcRKO88n4y"},
{"title": "EY Indigenous Vacationer Program", "company": "EY Indigenous Vacationer Program\n\n", "job_description": "\n\nAI Job Summary\nRead More\nWhat if we didn’t focus on who you are now, but who you could become?\nAt EY, we value you for your unique perspective and potential. We bring together extraordinary people, like you, to build a better working world. We're offering you more than just a job - we're offering you the exceptional EY experience. After all, it's not just about where you're going; it's about how you'll grow to get there.\nWhat’s in it for you?\n\nWe offer more than just an internship. We offer a launchpad for personal and professional growth. You'll foster a strong network of colleagues, mentors, and leaders who are committed to supporting you on your EY journey and beyond. From the start, you'll receive dedicated training and coaching, work hands-on with real clients, and immerse in EY’s vibrant culture. Those who stand out may be offered a permanent role after graduation.\nAs an Indigenous Intern you can explore your interests and expect to participate in a structured program including:\nInduction program, skill development workshops and technical training. \nLearning from an Indigenous mentor who will assist you throughout your EY journey. \nYarning circles to connect you with other Indigenous interns across Australia. \nSocial events to assist you to build your networks across service lines. \nWe’re currently looking for students from a range of degrees for all EY service lines. You can find out more about our service lines and teams by visiting our careers pages:\nAssurance : https://ey.com/au/careers/assurance\nConsulting : https://ey.com/au/careers/consulting\nStrategy and Transactions : https://ey.com/au/careers/strategyandtransactions\nTax : https://ey.com/au/careers/tax\nEligibility\n\nTo apply for our Indigenous Internship, you are required to:\nIdentify as Aboriginal or Torres Strait Islander or both\nCurrently studying a university degree\n\nWhat you can expect\n\nAll candidates are required to submit an online application attaching their passport (or alternative ID), CV and academic transcript. If you are unable to do this due to accessibility, email our First Nations Recruitment team for a confidential discussion: [email\\xa0protected]\nOnce we review your application, you may be invited to an interview or Recruitment Day. We’ll guide you through this process with as much or as little support as you need \nWe recommend applying early as we will be recruiting on an ongoing basis, and positions will close once filled.\nPlease note that it can take up to six weeks to hear from us as we have a rigorous recruitment process in place for our student program roles.\n\n", "closing_date": "14th Feb 2025, 12:59 pm\n\n", "work_rights": "Australian Citizen\n\n", "discipline": "\n(shown as \"Accounting, Arts and Humanities, Banking and\" and continues to show more, not a specific discipline)", "application_link": "https://www.ey.com/en_au/careers/students-apply-here"},
{"title": "EY Vacationer Science Program", "company": "EY Vacationer Science Program\n\n", "job_description": "What if we didn’t focus on who you are now, but who you could become? At EY, we value you for your unique perspective and potential. We bring together extraordinary people, like you, to build a better working world. We're offering you more than just a job - we're offering you the exceptional EY experience. After all, it's not just about where you're going; it's about how you'll grow to get there. We offer more than just an internship. We offer a launchpad for personal and professional growth. You'll foster a strong network of colleagues, mentors, and leaders who are committed to supporting you on your EY journey and beyond. From the start, you'll receive dedicated training and coaching, work hands-on with real clients, and immerse in EY’s vibrant culture. Those who stand out may be offered a permanent role after graduation.\n\n", "closing_date": "30th Dec 2024, 8:10 pm\n\n", "work_rights": "New Zealand Citizen, Australian Citizen\n\n", "discipline": "Compliance, Computer Science, Consulting, Cyber Security", "application_link": "https://www.ey.com/en_au/careers/students-apply-here"},
{"title": "Data/Business Analyst Internship Program 2024", "company": "Data/Business Analyst Internship Program 2024\n\n", "job_description": "The remaining file services being delivered via the on-premises physical server are the H:, M: and S: drives, with expected benefits such as Enhance our cybersecurity posture through integrated MS365 security, Support accessibility from anywhere, any device, Ease of document sharing with members and other external entities, Ease of data interoperability with other cloud applications, Categorisation of what exists and usage, Articulation of the current range of inconsistent document management practices., Understanding of the target 'to be' options for each file category, including the 'good practice' examples currently in use., Planning, then effecting, the migration off S: along multiple dimensions, for example, by: Function, Individual, Folder, CICM governance fora, Committee etc.\n\n", "closing_date": "28th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Data Science", "application_link": "https://readygrad.com.au/gc-data-analyst-internship"},
{"title": "Machine Learning Engineer Intern (Trust & Safety) - 2024 Nov/Dec Start", "company": "TikTok\n\n", "job_description": "Machine Learning Engineer Intern (Trust & Safety) - 2024 Nov/Dec Start, AI Job Summary, Creation is the core of TikTok's purpose. Our platform is built to help imaginations thrive. This is doubly true of the teams that make TikTok possible. Together, we inspire creativity and bring joy - a mission we all believe in and aim towards achieving every day. Our engineering team is responsible for developing state-of-the-art machine learning models and algorithms to protect our platform and users from the content and behaviors that violate community guidelines and related local regulations. With the continuous efforts from our team, TikTok is able to provide the best user experience and bring joy to everyone in the world. We are looking for talented individuals to join us for an internship in November / December 2024. Internships at TikTok aim to offer students industry exposure and hands-on experience. Build industry-leading content safety systems for TikTok; Develop highly-scalable classifiers, tools, models and algorithms leveraging cutting-edge machine learning, computer vision and data mining technologies; Understand product objectives and improve trust and safety strategy and model's performance; Work with cross-functional teams to protect TikTok globally.\n\n", "closing_date": "30th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Working\n\n", "discipline": "Computer Science, Engineering, Engineering Software", "application_link": "https://lifeattiktok.com/search/7332422590395468042?spread=BPHESC1"},
{"title": "Applications Chemist Intern - Molecular Spectroscopy", "company": "Agilent\n", "job_description": "Are you stimulated by the opportunity to expand your research skills with access to the latest technology in molecular spectroscopy? We are seeking an Applications Chemist Intern to support the development application solutions and sales collateral that contributes to increase the visibility for molecular spectroscopy to our key target markets of Chemical and Energy, Environmental, Materials, and Food.\n", "closing_date": "November 29th, 2024, 4:37 am\n", "work_rights": "Australian Skilled Migration Visa (485)\n", "discipline": "Computer Science, Data Science and Analytics", "application_link": "https://www.acsfoundation.com.au/internship/applications-chemist-intern---molecular-spectroscopy"},
{"title": "Applications Chemist Intern - Atomic Spectroscopy", "company": "Agilent\n\n", "job_description": "Want to broaden your Atomic Spectroscopy skills and gain valuable industry experience? We are seeking an Intern Chemist to join the Atomic Spectroscopy Marketing Team. Be part of the team that is shaping the future in Atomic Spectroscopy, working on cutting edge technology as part of a global team in our Australian Head Office in Mulgrave. As part of the Applications Development team you will build on your basic knowledge of scientific theories and marketing principles. You will work with a dynamic team that's designing and implementing marketing strategies and liaising with other functions to develop new products, and you'll have all the support and encouragement you need grow your skills and knowledge base as you go.\n\n", "closing_date": "29-10-2024\n\n", "work_rights": "Australian Skilled Migration Visa (485)\n\n", "discipline": "Computer Science, Data Science and Analytics", "application_link": "https://www.acsfoundation.com.au/internship/applications-chemist-intern"},
{"title": "Internship expression of interest 2025", "company": "Canva\n\n", "job_description": "Hey there, are you looking for your dream job as an Engineer or Designer at Canva? We'll be looking for our next cohort of Interns early next year for a Dec 2025 start, if you're in your penultimate year of study in 2025, we'd love to hear from you.\n\n", "closing_date": "30th Dec 2024, 12:59 pm\n\n", "work_rights": "Australian Student Visa, New Zealand, Work from home: Hybrid remote\n\n", "discipline": "Computer Science, Cyber Security, Design", "application_link": "https://form.typeform.com/to/KXwIFrFz?typeform-source=au.gradconnection.com"},
{"title": "Join - Amazon WoW ANZ", "company": "Amazon WoW ANZ\n", "job_description": "Amazon WoW (Women of the World), is a skill development program to support women students in Australia & New Zealand. It helps women students envision and build long-term careers in technology. Students get an opportunity to connect with leaders and technologists, and build essential career skills. The program seeks to inspire and enable the next generation of women tech leaders and innovators by providing access to Amazon’s industry-leading resources and expertise.\n", "closing_date": "1st Dec 2025, 12:59 pm\n", "work_rights": "Australian Student Visa, Australian Bridging\n", "discipline": "Computer Science, Engineering Software", "application_link": "https://amazon.jobs/content/en-gb/career-programs/student-programs/women-of-the-world"},
{"title": "IT and Computer Science Internships", "company": "The Intern Group\n\n", "job_description": "IT and Computer Science Internships, Share job ad, AI Job Summary, Read More, This internship is available through The Intern Group's internship program, fees start at 1990 USD and depend on program destination and duration., We offer first-class international computer science & IT internships in companies of all sizes, from large multinational corporations to exciting start-ups. Technology dominates our daily lives and plays a pivotal role in the business world and an internship in IT will help you stand out in this competitive industry., Overview, Empower your IT career aspirations with a challenging and rewarding computer science & IT internship. Gain a distinct advantage in the global tech landscape by acquiring highly sought-after skills through hands-on internships at renowned organisations. , Explore your passion for IT specialisations, develop your expertise under the guidance of industry leaders, and build a compelling resume that showcases your practical experience., We have previously placed interns in roles specialising in app and website development, cyber security, data science, machine learning, UX, software engineering and database design and management, online & in all of our programme destinations., Our award-winning programme matches internship opportunities to your specific interests and skills. From multinational corporations and cutting-edge business incubators, to innovative startups, we partner with many leading organisations in the IT & Computer Science industry who are looking for interns like you., Responsibilities, Some responsibilities that you may have whilst completing an IT internship programme include:, Front and back-end web development, Using a variety of coding languages, Quality Assurance Testing to ensure that all bugs are found, Working with robots to automate manual processes, Data engineering, management, and analysis, Available programmes, In Person Computer Science & IT internships:, Combine first-class professional experience and culture immersion with an in-person IT internship in global cities., Remote Computer Science & IT internships:, Make your resume shine and grow your network, wherever you are - all you need is your laptop. Our virtual internship programme includes a remote internship to fit your schedule, best-in-class career advancement training and twelve-month access to exclusive, real-time keynote career talks from global business leaders., Digital Nomad Computer Science & IT internships:, Travel to an exciting international destination and work remotely. Live and work like a local!, What’s Included, Guaranteed internship, Exclusive workshop series, Professional development materials, Career advancement training, Global community & network, Alumni success coaching, CV improvement tool, 24/7 support, Visa support, Accommodation (if applicable), Airport pickup, Cultural & social events, Duration, Between 4 and 24 weeks, depending on the programme and destination., Start Dates, You can start your internship at the time that suits you – we offer internship start dates every month, all-year-round., Time Commitment, In-person programmes usually demand a full-time commitment for your internship., Remote and Digital Nomad programmes can be full-time or part-time., About The Intern Group, With over 1,000+ five star reviews, The Intern Group is the leading provider of award-winning internship programmes, online and abroad, in the USA, Europe, Asia, Australia and Latin America. Become part of our 15,000+ global alumni network and embark on your international tech journey today to unlock your full potential!, How to apply, To apply for this role and to find out more, please click on the apply button., What our Alumni Say, “My 2 month Dublin internship was amazing. I learned so many valuable skills, which I have no doubt will aid me in my future endeavours. The TIG team was very supportive and friendly. The program not only gives you a chance to gain work experience but also so many other experiences in the chosen location where you can meet new people and form connections as well as learn about the location's people and culture.”, Anas A., 17-11-2024\n\n", "closing_date": "7th Dec 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Information Systems, Information Technology", "application_link": "https://app.theinterngroup.com/apply?utm_source=grad-connection&utm_medium=listing-page&utm_campaign=third-party-advertisers&utm_content=it-computer-science"},
{"title": "Software Engineer Internship Program 2024", "company": "Readygrad's Profession Internship Program\n\n", "job_description": "This internship is available through Readygrad's Profession Internship Program, which includes a fee of $2,995 (incl. GST) payable in 6 equal instalments ($499 each) and includes: Career coaching, Interview & resume preparation, Internship success toolkit access, Guaranteed 12-week internship placement, A dedicated mentor to guide you, Insurance, Certification, Ongoing support. The intern will learn real-world engineering practices coding in Angular and Postgres, continuous delivery processes, and the entire product development lifecycle (including release management and close engagement with the Product Owner). Delivery will utilise an agile approach (Jira, Confluence, Standups, Sprint Planning/Retrospectives, Release Planning, close collaboration). In addition, the intern will be exposed to support activities, QA (test) activities and tools (Postman), as well as coding (including bug fixes, feature requests, and performance improvements).\n\n", "closing_date": "28th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Engineering Software", "application_link": "https://readygrad.com.au/gc-software-engineer-internship"},
{"title": "Software Developer Internship Program 2024", "company": "Software Developer Internship Program 2024\n\n", "job_description": "This internship is available through Readygrad's Profession Internship Program, which includes a fee of $1,995 (incl. GST) payable in 6 equal instalments ($333 each) and includes: Career coaching, Interview & resume preparation, Internship success toolkit access, Guaranteed 12-week internship placement, A dedicated mentor to guide you, Insurance, Certification, Ongoing support. Our host company partner seeks talented Software developers that can integrate with their team of Developers. The interns will be responsible for providing clients across multiple industry sectors with an exceptional digital experience. Interns are critical thinkers and problem solvers who will be tested as they work on projects using .NET/C#, Angular/React, JavaScript, MVC + WebAPI, and SQL Server/TSQL. They will also be responsible for testing and debugging code to ensure high quality and accuracy. Key Responsabilites & Duties: Assist in the design of software to meet functional and technical requirements, Developed and implemented new software applications, Maintain and improve functionality and performance of existing software, Documented code and changes thoroughly, Participate in the execution and documentation of software testing, Design and update software database, Document software requirements and functional specs and write technical documents, Communicate regularly with team members and other departments/management as required, Accomplish mission by completing required results. Essential Selection Criteria: Exposure to software development, Strong attention to detail, Serves as a committed team player who is willing to both offer help and ask for help when needed, Adapts quickly to changing circumstances and workloads, Anticipates future issues with solutions ready in advance, Exhibits the confidence to interact with clients when required, Strong verbal and written communication skills, understanding of when to listen, talk, and how to write clearly for their audience.\n\n", "closing_date": "28th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Engineering Software", "application_link": "https://readygrad.com.au/gc-software-developer-internship"},
{"title": "Cyber Security Analyst Internship Program 2024", "company": "Cyber Security Analyst Internship Program 2024\n\n", "job_description": "This internship is available through Readygrad's Profession Internship Program, which includes a fee of $1,995 (incl. GST) payable in 6 equal instalments ($333 each) and includes: Career coaching, Interview & resume preparation, Internship success toolkit access, Guaranteed 12-week internship placement, A dedicated mentor to guide you, Insurance, Certification, Ongoing support. Our host company partner seeks a talented Cyber Security Analyst to help them keep their staff well-informed of the latest security risks and best practices, further reducing the risk of breaches. Their regular testing and vulnerability scans of systems will ensure that the business always maintains secure solutions, providing peace of mind for the organization and clients. Join them, and be integral to their mission to provide a secure and trustworthy computing environment for all their stakeholders.\n\n###Key Responsabilites & Duties: \n Improve the security of your computer system/networks against cyber threats, Ensure compliance with partners and regulatory requirements while staying up to date on best practices, Streamline business roles and access controls to reduce the risk of data breaches, Keep staff well informed of security risks and applications/tools through comprehensive training programs, Regular testing and vulnerability scans of systems to maintain secure solutions\n\n###Essential Selection Criteria: \n Cyber Security Certification, An understanding of mitigating and dealing with threat events, Ability to develop and manage cyber security infrastructure, supply chains and procurement, Exposure to Okta, Sumo Logic, Sophos, Ability to quickly digest and understand new and foreign information, Strong communication and people management skills, A collaborative approach\n\n", "closing_date": "28th Nov 2024 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Engineering Software", "application_link": "https://readygrad.com.au/gc-cyber-security-analyst-internship"},
{"title": "Security Analyst Internship Program 2024", "company": "Security Analyst Internship Program 2024\n\n", "job_description": "This Internship is available through Readygrad's Profession Internship Program, which includes a fee of\\xa0$1,995\\xa0(incl. GST) payable in 6 equal instalments ($333 each) and includes: Career coaching, Interview & resume preparation, Internship success toolkit access, Guaranteed 12-week internship placement, A dedicated mentor to guide you, Insurance, Certification, Ongoing support. Our host company partner seeks a talented Security Analyst to help them evaluate new security technologies and enhance their cybersecurity structure.\n\n", "closing_date": "28th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Engineering Software", "application_link": "https://readygrad.com.au/gc-security-analyst-internship"},
{"title": "IT HelpDesk Intern in Brisbane", "company": "\nWe are a global digital services and solutions provider, that leverages emerging technologies and deep domain expertise to deliver real-world business impact for our clients.\n\n", "job_description": "\nIT HelpDesk Intern in Brisbane. Share job ad. AI Job Summary. Read More. About Us. We are a global digital services and solutions provider, that leverages emerging technologies and deep domain expertise to deliver real-world business impact for our clients. Role Responsibilities. Major: Build and maintain good stakeholder relationships. Coordinate with 3rd Party vendors for delivery of IT equipment. Escalate issues to vendors, and work towards resolution e.g., Kiosks, Scanners, Printers etc. General: Ensure that best practices and standards are followed. Identifying the areas of improvement and implement them within timelines. Initiate, demonstrate, and assume ownership of improvement areas of functionalities. Follow established guidelines, processes, design standards and enterprise development. Proactively identify opportunities to improve IT processes and procedures to enhance end user experience and operational efficiency. Participate in IT projects and initiatives as assigned, providing technical expertise and support as needed. Stock management: Manage hardware stock level, and order IT equipment as required. Always ensure availability of end user devices. About You. You must be undertaking a relevant IT/Computer Science/Related Degree, preferably a penultimate year or final year student. The successful candidate will be flexible and able to work full-time. Good understanding of Laptop, desktop, software, imagining & Printers etc. Understanding business priorities, impact, and urgency across all areas. Strong customer service skills and excellent communication skills via phone, email, and live chat. This role will amount to $50,128 tax-free for a student studying a relevant IT degree working full-time for 12 months.\n\n", "closing_date": "\n26th Nov 2024, 12:59 pm\n\n", "work_rights": "\nAustralian Citizen, Australian Permanent Resident\n\n", "discipline": "\nComputer Science, Information Systems, Information Technology", "application_link": null},
{"title": "Application Security Engineer Internship Program 2024", "company": "Readygrad's Profession Internship Program\n\n", "job_description": "As an Application Security Engineer intern, you will be responsible for the detection and mitigation of potential security threats to software applications.\n\n", "closing_date": "28th Nov 2024, 1:59 pm\n\n", "work_rights": "Australian Student Visa, Australian Bridging\n\n", "discipline": "Computer Science, Cyber Security, Engineering Software", "application_link": "https://readygrad.com.au/gc-application-security-engineer-internship"}
]